Tekla.Structures.Drawing.View
The View class contains methods related to views.
Views are views that contain other drawing objects, excluding other views.
Views also contain drawing representations of model objects.
The following example creates and inserts two new views to the active drawing.
A drawing must be open when executing the code.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Beam beam = new Beam(new Point(0, 0, 0), new Point(500, 0, 0));
beam.Profile.ProfileString = "HEA300";
beam.Insert();
Beam column = new Beam(new Point(0, 0, 0), new Point(0, 0, 500));
column.Profile.ProfileString = "HEA200";
column.Insert();
new Model().CommitChanges();
DrawingHandler myDrawingHandler = new DrawingHandler();
if(myDrawingHandler.GetConnectionStatus())
{
Drawing currentDrawing = myDrawingHandler.GetActiveDrawing();
CoordinateSystem coordSysPlan = new CoordinateSystem(
new Point(), new Vector(1, 0, 0), new Vector(0, 1, 0));
CoordinateSystem coordSys3d = new CoordinateSystem(
new Point(), new Vector(0.5, 0.866, 0), new Vector(-0.296, 0.171, 0.94));
View newPlanView = new View(Drawing.GetSheet(), coordSysPlan, coordSysPlan,
new AABB(new Point(-1000, -1000, -1000), new Point(1000, 1000, 1000)));
newPlanView.Insert();
View new3dView = new View(Drawing.GetSheet(), coordSysPlan, coordSys3d,
new AABB(new Point(-1000, -1000, -1000), new Point(1000, 1000, 1000)));
new3dView.Insert();
currentDrawing.PlaceViews();
}
}
}

Tekla.Structures.Drawing.View.Attributes
The view attributes.

Tekla.Structures.Drawing.View.VisibleAreaRestrictionBoxes
Visible area restriction boxes.

Tekla.Structures.Drawing.View.Parts
Parts.

Tekla.Structures.Drawing.View.RestrictionBox
The axis aligned bounding box that represents the volume of the view.
Tekla.Structures.Drawing.View.GetVisibleAreaRestrictionBoxes

Tekla.Structures.Drawing.View.Name
The name of the view.

Tekla.Structures.Drawing.View.ViewCoordinateSystem
The coordinate system of the view plane.

Tekla.Structures.Drawing.View.DisplayCoordinateSystem
The coordinate system of the display plane.
This can be used to transform global points from the model that is to be inserted in the view.

Tekla.Structures.Drawing.View.ViewType
The view type information.

Tekla.Structures.Drawing.View.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.View.#ctor
Create instance of View.
Internal

Tekla.Structures.Drawing.View.#ctor(System.Boolean)
Create instance of View

Tekla.Structures.Drawing.View.#ctor(Tekla.Structures.Drawing.ContainerView,Tekla.Structures.Geometry3d.CoordinateSystem,Tekla.Structures.Geometry3d.CoordinateSystem,System.String)
Create instance of View.
Internal

Tekla.Structures.Drawing.View.#ctor(Tekla.Structures.Drawing.ContainerView,Tekla.Structures.Geometry3d.CoordinateSystem,Tekla.Structures.Geometry3d.CoordinateSystem,Tekla.Structures.Geometry3d.AABB)
Creates a new view instance with the given coordinate systems and model area.
View: The container view where the view is placed.
ViewCoordinateSystem: The coordinate system of the view restriction box.
DisplayCoordinateSystem: The coordinate system of the display plane.
RestrictionBox: The restriction box describing the area of the model (in the view coordinate system).

Tekla.Structures.Drawing.View.#ctor(Tekla.Structures.Drawing.ContainerView,Tekla.Structures.Geometry3d.CoordinateSystem,Tekla.Structures.Geometry3d.CoordinateSystem,System.Collections.ArrayList)
Creates a new view instance with the given coordinate systems and part list.
View: The container view where the view is placed.
ViewCoordinateSystem: The coordinate system of the view restriction box.
DisplayCoordinateSystem: The coordinate system of the display plane.
PartList: An array list of identifiers of model objects to be shown in the view.

Tekla.Structures.Drawing.View.#ctor(Tekla.Structures.Drawing.ContainerView,Tekla.Structures.Geometry3d.CoordinateSystem,Tekla.Structures.Geometry3d.CoordinateSystem,Tekla.Structures.Geometry3d.AABB,System.String)
Creates a new view instance with the given coordinate systems, model area and attributes file's filename.
View: The container view where the view is placed.
ViewCoordinateSystem: The coordinate system of the view restriction box.
DisplayCoordinateSystem: The coordinate system of the display plane.
RestrictionBox: The restriction box describing the area of the model (in the view coordinate system).
Attributes: The name of the attributes file to be used.

Tekla.Structures.Drawing.View.#ctor(Tekla.Structures.Drawing.ContainerView,Tekla.Structures.Geometry3d.CoordinateSystem,Tekla.Structures.Geometry3d.CoordinateSystem,System.Collections.ArrayList,System.String)
Creates a new view instance with the given coordinate systems, part list and attributes file's filename.
View: The container view where the view is placed.
ViewCoordinateSystem: The coordinate system of the view restriction box.
DisplayCoordinateSystem: The coordinate system of the display plane.
PartList: An array list of identifiers of model objects to be shown in the view. For reference models both reference model and reference model object are required.
Attributes: The name of the attributes file to be used.

Tekla.Structures.Drawing.View.GetModelObjects
Gets the model objects that are in the view.
Returns: The model objects that are in the view.

Tekla.Structures.Drawing.View.GetVisibleAreaRestrictionBoxes
Gets the restriction boxes that represent the visible areas of the view.
Returns: The restriction boxes that repserent the visible areas of the view.

Tekla.Structures.Drawing.View.CreateSectionView(Tekla.Structures.Drawing.View,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.Double,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes,Tekla.Structures.Drawing.View@,Tekla.Structures.Drawing.SectionMark@)
Generates a new section view on the sheet of the active drawing and the associated section mark for the specified view.
view: The view in which to place the section mark.
startPoint: The starting point of the section mark.
endPoint: The ending point of the section mark.
viewInsertionPoint: The point where to create the section view.
depthUp: The view depth up that the section view should cover.
depthDown: The view depth down that the section view should cover.
viewAttributes: The attributes for the section view to be created.
sectionMarkAttributes: The attributes for the section mark to be created.
sectionView:
The created section view is returned if the creation was successful. Otherwise, null is returned.
sectionMark:
The created section mark is returned if the creation was successful. Otherwise, null is returned.
Returns: True if the section view was created successfully.

Tekla.Structures.Drawing.View.CreateCurvedSectionView(Tekla.Structures.Drawing.View,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.Double,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.SectionMarkBase.SectionMarkAttributes,Tekla.Structures.Drawing.View@,Tekla.Structures.Drawing.CurvedSectionMark@)
Generates a new curved section view on the sheet of the active drawing and the associated section mark for the specified view.
view: The view in which to place the section mark.
startPoint: The starting point of the section mark.
middlePoint: The middle point of the section mark.
endPoint: The ending point of the section mark.
viewInsertionPoint: The point where to create the section view.
depthUp: The view depth up that the section view should cover.
depthDown: The view depth down that the section view should cover.
viewAttributes: The attributes for the section view to be created.
sectionMarkAttributes: The attributes for the section mark to be created.
curvedSectionView:
The created section view is returned if the creation was successful. Otherwise, null is returned.
sectionMark:
The created section mark is returned if the creation was successful. Otherwise, null is returned.
Returns: True if the section view was created successfully.

Tekla.Structures.Drawing.View.CreateDetailView(Tekla.Structures.Drawing.View,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes,Tekla.Structures.Drawing.View@,Tekla.Structures.Drawing.DetailMark@)
Generates a new detail view on the sheet of the active drawing and the associated detail mark for the specified view.
view: The view in which to place the detail mark.
centerPoint: The center point of the detail mark.
boundaryPoint: The boundary point of the detail mark.
labelPoint: The label point of the detail mark label.
viewInsertionPoint: The point where to create the detail view.
viewAttributes: The attributes for the detail view to be created.
detailMarkAttributes: The attributes for the detail mark to be created.
detailView:
The created detail view is returned if the creation was successful. Otherwise, null is returned.
detailMark:
The created detail mark is returned if the creation was successful. Otherwise, null is returned.
Returns: True if the detail view was created successfully.

Tekla.Structures.Drawing.View.CreateFrontView(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.View@)
Generates a new front view on the sheet of the given active drawing.
drawing: The active drawing in which to create the view.
viewInsertionPoint: The center point of the view.
viewAttributes: The attributes for the view to be created.
view:
The created view is returned if the creation was successful. Otherwise, null is returned.
Throws Tekla.Structures.Drawing.InvalidTypeException: Thrown if given drawing is GA drawing.
Throws Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException: Thrown if an unknown error occurrs.
Returns: True if the view was created successfully.

Tekla.Structures.Drawing.View.CreateTopView(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.View@)
Generates a new top view on the sheet of the given active drawing.
drawing: The active drawing in which to create the view.
viewInsertionPoint: The center point of the view.
viewAttributes: The attributes for the view to be created.
view:
The created view is returned if the creation was successful. Otherwise, null is returned.
Throws Tekla.Structures.Drawing.InvalidTypeException: Thrown if given drawing is GA drawing.
Throws Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException: Thrown if an unknown error occurrs.
Returns: True if the view was created successfully.

Tekla.Structures.Drawing.View.CreateBackView(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.View@)
Generates a new back view on the sheet of the given active drawing.
drawing: The active drawing in which to create the view.
viewInsertionPoint: The center point of the view.
viewAttributes: The attributes for the view to be created.
view:
The created view is returned if the creation was successful. Otherwise, null is returned.
Throws Tekla.Structures.Drawing.InvalidTypeException: Thrown if given drawing is GA drawing.
Throws Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException: Thrown if an unknown error occurrs.
Returns: True if the view was created successfully.

Tekla.Structures.Drawing.View.CreateBottomView(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.View@)
Generates a new bottom view on the sheet of the given active drawing.
drawing: The active drawing in which to create the view.
viewInsertionPoint: The center point of the view.
viewAttributes: The attributes for the view to be created.
view:
The created view is returned if the creation was successful. Otherwise, null is returned.
Throws Tekla.Structures.Drawing.InvalidTypeException: Thrown if given drawing is GA drawing.
Throws Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException: Thrown if an unknown error occurrs.
Returns: True if the view was created successfully.

Tekla.Structures.Drawing.View.Create3dView(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.View@)
Generates a new 3d view on the sheet of the given active drawing.
drawing: The active drawing in which to create the view.
viewInsertionPoint: The center point of the view.
viewAttributes: The attributes for the view to be created.
view:
The created view is returned if the creation was successful. Otherwise, null is returned.
Throws Tekla.Structures.Drawing.InvalidTypeException: Thrown if given drawing is GA drawing.
Throws Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException: Thrown if an unknown error occurrs.
Returns: True if the view was created successfully.

Tekla.Structures.Drawing.View.Create3dView(Tekla.Structures.Drawing.Drawing,Tekla.Structures.Geometry3d.CoordinateSystem,Tekla.Structures.Geometry3d.CoordinateSystem,Tekla.Structures.Geometry3d.AABB,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.View.ViewAttributes,Tekla.Structures.Drawing.View@)
Generates a new 3d view on the sheet of the given active drawing using given view plane and display plane.
drawing: The active drawing in which to create the view.
viewPlane: The view plane.
displayPlane: The display plane of the view.
viewExtrema: The restriction box of the view.
viewInsertionPoint: The center point of the view.
viewAttributes: The attributes for the view to be created.
view:
The created view is returned if the creation was successful. Otherwise, null is returned.
Throws Tekla.Structures.Drawing.InvalidTypeException: Thrown if given drawing is GA drawing.
Throws Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException: Thrown if an unknown error occurrs.
Returns: True if the view was created successfully.

Tekla.Structures.Drawing.View.CreateModelView(Tekla.Structures.Drawing.Drawing,System.Int32,System.Boolean,Tekla.Structures.Drawing.View@)
Generates a new model view on the sheet of the given active drawing using given model view id.
drawing: The active drawing in which to create the view.
modelViewId: The model view id.
useDrawingAttributes: True if the drawing level attributes should be used.
view:
The created view is returned if the creation was successful. Otherwise, null is returned.
Throws Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException: Thrown if an unknown error occurrs.
Returns: True if the view was created successfully.

Tekla.Structures.Drawing.View.GetPreferredFollowedObject
Gets the preferred followed object for the view, if it's supported.
Note: this is currently only supported for section views in fabrication drawings.
Returns: Identifier of the preferred object where Tekla.Structures.Identifier.ID is the model object ID.
Throws System.InvalidOperationException: Thrown if the current drawing is a GA drawing or the current view is not a section view.

Tekla.Structures.Drawing.View.SetPreferredFollowedObject(Tekla.Structures.Identifier)
Sets the preferred rule object for the section view based on model object ID or Guid.
Note: this is currently only supported for section views in fabrication drawings.
identifier:
Identifier of the preferred object.
The followed object can be set either with Tekla.Structures.Identifier.ID or Tekla.Structures.Identifier.GUID.
Throws System.InvalidOperationException: Thrown if the current drawing is a GA drawing or the current view is not a section view.

Tekla.Structures.Drawing.View.GetPossibleFollowedObjects
Get the possible rule objects for the section view.
Note: this is currently only supported for section views in fabrication drawings.
Returns: List of identifiers where Tekla.Structures.Identifier.ID is the model object ID.
Throws System.InvalidOperationException: Thrown if the current drawing is a GA drawing or the current view is not a section view.

Tekla.Structures.Drawing.View.RotateViewOnAxisX(System.Double)
Rotate the view on the X axis.
rotationAngle: The amount of degrees to rotate the view with.

Tekla.Structures.Drawing.View.RotateViewOnAxisY(System.Double)
Rotate the view on the Y axis.
rotationAngle: The amount of degrees to rotate the view with.

Tekla.Structures.Drawing.View.RotateViewOnAxisZ(System.Double)
Rotate the view on the Z axis.
rotationAngle: The amount of degrees to rotate the view with.

Tekla.Structures.Drawing.View.RotateViewOnDrawingPlane(System.Double)
Rotate the view on the drawings plane.
This works just like the user interface command "Rotate view".
rotationAngle: The amount of degrees to rotate the view with.

Tekla.Structures.Drawing.View.AddDimensioningRuleAndModify(System.String,System.String,System.String)
hackish way to add a rule to the view dimensioning rules
the view is modified by the method
something public should include full support for the list of rules in the ViewAttributes class
filter: filter field of the rule
operation: type of the rule
property: attribute of the rule
Returns: true is successful, false otherwise

Tekla.Structures.Drawing.View.AddObjectsToViewAndModify(System.Collections.Generic.List{Tekla.Structures.Identifier})
Add objects to the view in GA drawing if view is created with object list
the view is modified by the method
objects: Objects to be added to view
Returns: true is successful, false otherwise